Revit 2026 API

# WallKind Enumeration

---

Describes the fundamental type of wall, such as curtain wall or stacked wall.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WallKind
```
```vb
Public Enumeration WallKind
```
```cpp
public enum class WallKind
```
```fsharp
type WallKind
```

| Member name | Value | Description |
| --- | --- | --- |
| Basic | 0 | A standard wall. |
| Curtain | 1 | A curtain wall. |
| Stacked | 2 | A stacked wall of several wall types. |
| Unknown | -1 | The basic type is not known. |

#### Reference

Autodesk.Revit.DB Namespace